#### Terraform Format and Style 🖌`success`

<details><summary>Format Output</summary>

```


```

</details>

#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

"data.terraform_remote_state.stacks: Reading...
data.terraform_remote_state.stacks_platform_platform-k8s: Reading...
data.github_repository_file.argocd: Reading...
data.github_repository_file.argocd_apps: Reading...
data.terraform_remote_state.stacks: Read complete after 0s
data.terraform_remote_state.stacks_platform_platform-k8s: Read complete after 0s
data.external.aws_eks_cluster_ca_certificate: Reading...
data.external.aws_eks_cluster_endpoint: Reading...
data.external.aws_eks_cluster_token: Reading...
module.cluster_autoscaler_irsa.data.aws_region.current: Reading...
module.cluster_autoscaler_irsa.data.aws_caller_identity.current: Reading...
module.node_termination_handler_irsa.data.aws_iam_policy_document.node_termination_handler[0]: Reading...
module.cluster_autoscaler_irsa.data.aws_iam_policy_document.cluster_autoscaler[0]: Reading...
module.cluster_autoscaler_irsa.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.node_termination_handler_irsa.data.aws_iam_policy_document.node_termination_handler[0]: Read complete after 0s [id=734748348]
module.cluster_autoscaler_irsa.data.aws_iam_policy_document.cluster_autoscaler[0]: Read complete after 0s [id=883043623]
module.external_secrets_irsa.data.aws_iam_policy_document.external_secrets[0]: Reading...
module.cert_manager_irsa.data.aws_partition.current: Reading...
module.external_dns_irsa.data.aws_iam_policy_document.external_dns[0]: Reading...
module.cert_manager_irsa.data.aws_caller_identity.current: Reading...
module.external_secrets_irsa.data.aws_iam_policy_document.external_secrets[0]: Read complete after 0s [id=181387571]
module.external_secrets_irsa.data.aws_caller_identity.current: Reading...
module.cert_manager_irsa.data.aws_partition.current: Read complete after 0s [id=aws]
module.external_dns_irsa.data.aws_iam_policy_document.external_dns[0]: Read complete after 0s [id=1621011895]
data.github_repository_file.argocd_apps: Read complete after 0s [id=argo/config/argocd-apps-values.yaml]
module.load_balancer_controller_irsa.data.aws_region.current: Reading...
module.node_termination_handler_irsa.data.aws_partition.current: Reading...
module.node_termination_handler_irsa.data.aws_region.current: Reading...
module.cluster_autoscaler_irsa.data.aws_caller_identity.current: Read complete after 0s [id=023093918714]
module.load_balancer_controller_irsa.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.node_termination_handler_irsa.data.aws_partition.current: Read complete after 0s [id=aws]
module.external_secrets_irsa.data.aws_caller_identity.current: Read complete after 0s [id=023093918714]
module.external_dns_irsa.data.aws_caller_identity.current: Reading...
module.node_termination_handler_irsa.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.cert_manager_irsa.data.aws_caller_identity.current: Read complete after 0s [id=023093918714]
module.external_dns_irsa.data.aws_region.current: Reading...
module.load_balancer_controller_irsa.data.aws_caller_identity.current: Reading...
module.node_termination_handler_irsa.data.aws_caller_identity.current: Reading...
module.crossplane_irsa.data.aws_partition.current: Reading...
module.crossplane_irsa.data.aws_region.current: Reading...
module.external_dns_irsa.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.load_balancer_controller_irsa.data.aws_caller_identity.current: Read complete after 0s [id=023093918714]
module.crossplane_irsa.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.external_dns_irsa.data.aws_caller_identity.current: Read complete after 0s [id=023093918714]
module.crossplane_irsa.data.aws_partition.current: Read complete after 0s [id=aws]
module.cluster_autoscaler_irsa.data.aws_partition.current: Reading...
module.node_termination_handler_irsa.data.aws_caller_identity.current: Read complete after 0s [id=023093918714]
module.external_dns_irsa.data.aws_partition.current: Reading...
module.external_secrets_irsa.data.aws_region.current: Reading...
module.cluster_autoscaler_irsa.data.aws_partition.current: Read complete after 0s [id=aws]
module.crossplane_irsa.data.aws_caller_identity.current: Reading...
module.cert_manager_irsa.data.aws_region.current: Reading...
module.external_secrets_irsa.data.aws_partition.current: Reading...
module.cert_manager_irsa.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.external_secrets_irsa.data.aws_partition.current: Read complete after 0s [id=aws]
module.external_dns_irsa.data.aws_partition.current: Read complete after 0s [id=aws]
module.external_secrets_irsa.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.load_balancer_controller_irsa.data.aws_partition.current: Reading...
module.crossplane_irsa.data.aws_caller_identity.current: Read complete after 0s [id=023093918714]
module.load_balancer_controller_irsa.data.aws_partition.current: Read complete after 0s [id=aws]
module.cluster_autoscaler_irsa.data.aws_iam_policy_document.this[0]: Reading...
module.node_termination_handler_irsa.data.aws_iam_policy_document.this[0]: Reading...
module.cert_manager_irsa.data.aws_iam_policy_document.this[0]: Reading...
module.external_secrets_irsa.data.aws_iam_policy_document.this[0]: Reading...
module.cluster_autoscaler_irsa.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=2006896540]
module.cert_manager_irsa.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=3471046844]
module.node_termination_handler_irsa.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=855124697]
module.load_balancer_controller_irsa.data.aws_iam_policy_document.load_balancer_controller[0]: Reading...
module.cert_manager_irsa.data.aws_iam_policy_document.cert_manager[0]: Reading...
module.external_secrets_irsa.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=3484627895]
module.crossplane_irsa.data.aws_iam_policy_document.this[0]: Reading...
module.external_dns_irsa.data.aws_iam_policy_document.this[0]: Reading...
module.load_balancer_controller_irsa.data.aws_iam_policy_document.this[0]: Reading...
module.cert_manager_irsa.data.aws_iam_policy_document.cert_manager[0]: Read complete after 0s [id=1322757125]
module.load_balancer_controller_irsa.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=3474150769]
module.crossplane_irsa.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=3285820958]
data.github_repository_file.argocd: Read complete after 0s [id=argo/config/argo-cd-values.yaml]
module.external_dns_irsa.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=669401809]
module.load_balancer_controller_irsa.data.aws_iam_policy_document.load_balancer_controller[0]: Read complete after 1s [id=898716815]
data.external.aws_eks_cluster_ca_certificate: Read complete after 2s [id=-]
data.external.aws_eks_cluster_token: Read complete after 2s [id=-]
data.external.aws_eks_cluster_endpoint: Read complete after 2s [id=-]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # helm_release.argocd will be created
  + resource "helm_release" "argocd" {
      + atomic                     = false
      + chart                      = "argo-cd"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = true
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "argocd"
      + namespace                  = "argocd"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://argoproj.github.io/argo-helm"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + (sensitive),
        ]
      + verify                     = false
      + version                    = "5.28.1"
      + wait                       = false
      + wait_for_jobs              = false
    }

  # helm_release.argocd_apps will be created
  + resource "helm_release" "argocd_apps" {
      + atomic                     = false
      + chart                      = "argocd-apps"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = true
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "argocd-apps"
      + namespace                  = "argocd"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://argoproj.github.io/argo-helm"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + (sensitive),
        ]
      + verify                     = false
      + version                    = "0.0.9"
      + wait                       = false
      + wait_for_jobs              = false
    }

  # helm_release.aws_load_balancer_controller will be created
  + resource "helm_release" "aws_load_balancer_controller" {
      + atomic                     = false
      + chart                      = "aws-load-balancer-controller"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = true
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "aws-load-balancer-controller"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://aws.github.io/eks-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "1.4.8"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "clusterName"
          + value = "null"
        }
      + set {
          + name  = "region"
          + value = "us-east-1"
        }
      + set {
          + name  = "serviceAccount.annotations.eks\.amazonaws\.com/role-arn"
          + value = (known after apply)
        }
      + set {
          + name  = "vpcId"
          + value = jsonencode(
                [
                  + null,
                ]
            )
        }
    }

  # helm_release.cert_manager will be created
  + resource "helm_release" "cert_manager" {
      + atomic                     = false
      + chart                      = "cert-manager"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = true
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "cert-manager"
      + namespace                  = "cert-manager"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://charts.jetstack.io"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "v1.11.1"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "fullnameOverride"
          + value = "cert-manager"
        }
      + set {
          + name  = "installCRDs"
          + value = "true"
        }
      + set {
          + name  = "nameOverride"
          + value = "cert-manager"
        }
      + set {
          + name  = "securityContext.fsGroup"
          + value = "65534"
        }
      + set {
          + name  = "serviceAccount.annotations.eks\.amazonaws\.com/role-arn"
          + value = (known after apply)
        }
      + set {
          + name  = "serviceAccount.create"
          + value = "true"
        }
      + set {
          + name  = "serviceAccount.name"
          + value = "cert-manager"
        }
    }

  # helm_release.cluster_autoscaler will be created
  + resource "helm_release" "cluster_autoscaler" {
      + atomic                     = false
      + chart                      = "cluster-autoscaler"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = true
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "cluster-autoscaler"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kubernetes.github.io/autoscaler"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "9.28.0"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "autoDiscovery.clusterName"
          + value = "null"
        }
      + set {
          + name  = "awsRegion"
          + value = "us-east-1"
        }
      + set {
          + name  = "fullnameOverride"
          + value = "cluster-autoscaler"
        }
      + set {
          + name  = "rbac.serviceAccount.annotations.eks\.amazonaws\.com/role-arn"
          + value = (known after apply)
        }
      + set {
          + name  = "rbac.serviceAccount.name"
          + value = "cluster-autoscaler"
        }
      + set {
          + name  = "replicaCount"
          + value = "2"
        }
    }

  # helm_release.crossplane will be created
  + resource "helm_release" "crossplane" {
      + atomic                     = false
      + chart                      = "crossplane"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = true
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "crossplane"
      + namespace                  = "crossplane-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://charts.crossplane.io/stable"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "1.12.0"
      + wait                       = false
      + wait_for_jobs              = false

      + set {
          + name  = "args[0]"
          + value = "--enable-environment-configs"
        }
      + set {
          + name  = "serviceAccount.customAnnotations.eks\.amazonaws\.com/role-arn"
          + value = (known after apply)
        }
    }

  # helm_release.external_dns will be created
  + resource "helm_release" "external_dns" {
      + atomic                     = false
      + chart                      = "external-dns"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = true
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "external-dns"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kubernetes-sigs.github.io/external-dns"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "1.12.2"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "serviceAccount.annotations.eks\.amazonaws\.com/role-arn"
          + value = (known after apply)
        }
    }

  # helm_release.external_secrets will be created
  + resource "helm_release" "external_secrets" {
      + atomic                     = false
      + chart                      = "external-secrets"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = true
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "external-secrets"
      + namespace                  = "external-secrets"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://charts.external-secrets.io"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "0.8.1"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "serviceAccount.annotations.eks\.amazonaws\.com/role-arn"
          + value = (known after apply)
        }
    }

  # helm_release.node_termination_handler will be created
  + resource "helm_release" "node_termination_handler" {
      + atomic                     = false
      + chart                      = "aws-node-termination-handler"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = true
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "aws-node-termination-handler"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://aws.github.io/eks-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "0.21.0"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "awsRegion"
          + value = "us-east-1"
        }
      + set {
          + name  = "fullnameOverride"
          + value = "aws-node-termination-handler"
        }
      + set {
          + name  = "serviceAccount.annotations.eks\.amazonaws\.com/role-arn"
          + value = (known after apply)
        }
      + set {
          + name  = "serviceAccount.name"
          + value = "aws-node-termination-handler"
        }
    }

  # module.cert_manager_irsa.aws_iam_policy.cert_manager[0] will be created
  + resource "aws_iam_policy" "cert_manager" {
      + arn         = (known after apply)
      + description = "Cert Manager policy to allow management of Route53 hosted zone records"
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "AmazonEKS_Cert_Manager_Policy-"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "route53:GetChange"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:route53:::change/*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "route53:ListResourceRecordSets",
                          + "route53:ChangeResourceRecordSets",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:route53:::hostedzone/[null]"
                      + Sid      = ""
                    },
                  + {
                      + Action   = "route53:ListHostedZonesByName"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "App" = "platform-eks-dev"
        }
      + tags_all    = {
          + "App"            = "platform-eks-dev"
          + "Env"            = "dev"
          + "ManagedBy"      = "Terraform"
          + "OrchestratedBy" = "Terramate"
          + "Stack"          = "platform-k8s-apps"
          + "StackPath"      = "/stacks/platform/platform-k8s/apps"
        }
    }

  # module.cert_manager_irsa.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "[null]:aud" = "sts.amazonaws.com"
                              + "[null]:sub" = "system:serviceaccount:cert-manager:cert-manager"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = jsonencode(
                                [
                                  + null,
                                ]
                            )
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "cert-manager-dev"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "App" = "platform-eks-dev"
        }
      + tags_all              = {
          + "App"            = "platform-eks-dev"
          + "Env"            = "dev"
          + "ManagedBy"      = "Terraform"
          + "OrchestratedBy" = "Terramate"
          + "Stack"          = "platform-k8s-apps"
          + "StackPath"      = "/stacks/platform/platform-k8s/apps"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.cert_manager_irsa.aws_iam_role_policy_attachment.cert_manager[0] will be created
  + resource "aws_iam_role_policy_attachment" "cert_manager" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "cert-manager-dev"
    }

  # module.cluster_autoscaler_irsa.aws_iam_policy.cluster_autoscaler[0] will be created
  + resource "aws_iam_policy" "cluster_autoscaler" {
      + arn         = (known after apply)
      + description = "Cluster autoscaler policy to allow examination and modification of EC2 Auto Scaling Groups"
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "AmazonEKS_Cluster_Autoscaler_Policy-"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "eks:DescribeNodegroup",
                          + "ec2:GetInstanceTypesFromInstanceRequirements",
                          + "ec2:DescribeLaunchTemplateVersions",
                          + "ec2:DescribeInstanceTypes",
                          + "ec2:DescribeImages",
                          + "autoscaling:DescribeTags",
                          + "autoscaling:DescribeScalingActivities",
                          + "autoscaling:DescribeLaunchConfigurations",
                          + "autoscaling:DescribeAutoScalingInstances",
                          + "autoscaling:DescribeAutoScalingGroups",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                  + {
                      + Action    = [
                          + "autoscaling:TerminateInstanceInAutoScalingGroup",
                          + "autoscaling:SetDesiredCapacity",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "autoscaling:ResourceTag/kubernetes.io/cluster/null" = "owned"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "App" = "platform-eks-dev"
        }
      + tags_all    = {
          + "App"            = "platform-eks-dev"
          + "Env"            = "dev"
          + "ManagedBy"      = "Terraform"
          + "OrchestratedBy" = "Terramate"
          + "Stack"          = "platform-k8s-apps"
          + "StackPath"      = "/stacks/platform/platform-k8s/apps"
        }
    }

  # module.cluster_autoscaler_irsa.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "[null]:aud" = "sts.amazonaws.com"
                              + "[null]:sub" = "system:serviceaccount:kube-system:cluster-autoscaler"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = jsonencode(
                                [
                                  + null,
                                ]
                            )
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "cluster-autoscaler-dev"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "App" = "platform-eks-dev"
        }
      + tags_all              = {
          + "App"            = "platform-eks-dev"
          + "Env"            = "dev"
          + "ManagedBy"      = "Terraform"
          + "OrchestratedBy" = "Terramate"
          + "Stack"          = "platform-k8s-apps"
          + "StackPath"      = "/stacks/platform/platform-k8s/apps"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.cluster_autoscaler_irsa.aws_iam_role_policy_attachment.cluster_autoscaler[0] will be created
  + resource "aws_iam_role_policy_attachment" "cluster_autoscaler" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "cluster-autoscaler-dev"
    }

  # module.crossplane_iam_policy.aws_iam_policy.policy[0] will be created
  + resource "aws_iam_policy" "policy" {
      + arn         = (known after apply)
      + description = "Crossplane policy for IRSA on dev environment"
      + id          = (known after apply)
      + name        = "crossplane-dev"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "*"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = {
          + "Env"            = "dev"
          + "ManagedBy"      = "Terraform"
          + "OrchestratedBy" = "Terramate"
          + "Stack"          = "platform-k8s-apps"
          + "StackPath"      = "/stacks/platform/platform-k8s/apps"
        }
    }

  # module.crossplane_irsa.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringLike = {
                              + "[null]:aud" = "sts.amazonaws.com"
                              + "[null]:sub" = "system:serviceaccount:crossplane-system:provider-aws-*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = jsonencode(
                                [
                                  + null,
                                ]
                            )
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "crossplane-dev"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "App" = "platform-eks-dev"
        }
      + tags_all              = {
          + "App"            = "platform-eks-dev"
          + "Env"            = "dev"
          + "ManagedBy"      = "Terraform"
          + "OrchestratedBy" = "Terramate"
          + "Stack"          = "platform-k8s-apps"
          + "StackPath"      = "/stacks/platform/platform-k8s/apps"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.crossplane_irsa.aws_iam_role_policy_attachment.this["policy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "crossplane-dev"
    }

  # module.external_dns_irsa.aws_iam_policy.external_dns[0] will be created
  + resource "aws_iam_policy" "external_dns" {
      + arn         = (known after apply)
      + description = "External DNS policy to allow management of Route53 hosted zone records"
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "AmazonEKS_External_DNS_Policy-"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "route53:ChangeResourceRecordSets"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:route53:::hostedzone/*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "route53:ListResourceRecordSets",
                          + "route53:ListHostedZones",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "App" = "platform-eks-dev"
        }
      + tags_all    = {
          + "App"            = "platform-eks-dev"
          + "Env"            = "dev"
          + "ManagedBy"      = "Terraform"
          + "OrchestratedBy" = "Terramate"
          + "Stack"          = "platform-k8s-apps"
          + "StackPath"      = "/stacks/platform/platform-k8s/apps"
        }
    }

  # module.external_dns_irsa.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "[null]:aud" = "sts.amazonaws.com"
                              + "[null]:sub" = "system:serviceaccount:kube-system:external-dns"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = jsonencode(
                                [
                                  + null,
                                ]
                            )
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "external-dns-dev"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "App" = "platform-eks-dev"
        }
      + tags_all              = {
          + "App"            = "platform-eks-dev"
          + "Env"            = "dev"
          + "ManagedBy"      = "Terraform"
          + "OrchestratedBy" = "Terramate"
          + "Stack"          = "platform-k8s-apps"
          + "StackPath"      = "/stacks/platform/platform-k8s/apps"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.external_dns_irsa.aws_iam_role_policy_attachment.external_dns[0] will be created
  + resource "aws_iam_role_policy_attachment" "external_dns" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "external-dns-dev"
    }

  # module.external_secrets_irsa.aws_iam_policy.external_secrets[0] will be created
  + resource "aws_iam_policy" "external_secrets" {
      + arn         = (known after apply)
      + description = "Provides permissions to for External Secrets to retrieve secrets from AWS SSM and AWS Secrets Manager"
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "AmazonEKS_External_Secrets_Policy-"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "ssm:DescribeParameters"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "ssm:GetParameters",
                          + "ssm:GetParameter",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ssm:*:*:parameter/*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = "secretsmanager:ListSecrets"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "secretsmanager:ListSecretVersionIds",
                          + "secretsmanager:GetSecretValue",
                          + "secretsmanager:GetResourcePolicy",
                          + "secretsmanager:DescribeSecret",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:secretsmanager:*:*:secret:*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = "kms:Decrypt"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:kms:*:*:key/*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "App" = "platform-eks-dev"
        }
      + tags_all    = {
          + "App"            = "platform-eks-dev"
          + "Env"            = "dev"
          + "ManagedBy"      = "Terraform"
          + "OrchestratedBy" = "Terramate"
          + "Stack"          = "platform-k8s-apps"
          + "StackPath"      = "/stacks/platform/platform-k8s/apps"
        }
    }

  # module.external_secrets_irsa.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "[null]:aud" = "sts.amazonaws.com"
                              + "[null]:sub" = "system:serviceaccount:external-secrets:external-secrets"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = jsonencode(
                                [
                                  + null,
                                ]
                            )
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "external-secrets-dev"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "App" = "platform-eks-dev"
        }
      + tags_all              = {
          + "App"            = "platform-eks-dev"
          + "Env"            = "dev"
          + "ManagedBy"      = "Terraform"
          + "OrchestratedBy" = "Terramate"
          + "Stack"          = "platform-k8s-apps"
          + "StackPath"      = "/stacks/platform/platform-k8s/apps"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.external_secrets_irsa.aws_iam_role_policy_attachment.external_secrets[0] will be created
  + resource "aws_iam_role_policy_attachment" "external_secrets" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "external-secrets-dev"
    }

  # module.load_balancer_controller_irsa.aws_iam_policy.load_balancer_controller[0] will be created
  + resource "aws_iam_policy" "load_balancer_controller" {
      + arn         = (known after apply)
      + description = "Provides permissions for AWS Load Balancer Controller addon"
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "AmazonEKS_AWS_Load_Balancer_Controller-"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "iam:CreateServiceLinkedRole"
                      + Condition = {
                          + StringEquals = {
                              + "iam:AWSServiceName" = "elasticloadbalancing.amazonaws.com"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                      + Sid       = ""
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:DescribeTargetHealth",
                          + "elasticloadbalancing:DescribeTargetGroups",
                          + "elasticloadbalancing:DescribeTargetGroupAttributes",
                          + "elasticloadbalancing:DescribeTags",
                          + "elasticloadbalancing:DescribeSSLPolicies",
                          + "elasticloadbalancing:DescribeRules",
                          + "elasticloadbalancing:DescribeLoadBalancers",
                          + "elasticloadbalancing:DescribeLoadBalancerAttributes",
                          + "elasticloadbalancing:DescribeListeners",
                          + "elasticloadbalancing:DescribeListenerCertificates",
                          + "ec2:GetCoipPoolUsage",
                          + "ec2:DescribeVpcs",
                          + "ec2:DescribeVpcPeeringConnections",
                          + "ec2:DescribeTags",
                          + "ec2:DescribeSubnets",
                          + "ec2:DescribeSecurityGroups",
                          + "ec2:DescribeNetworkInterfaces",
                          + "ec2:DescribeInternetGateways",
                          + "ec2:DescribeInstances",
                          + "ec2:DescribeCoipPools",
                          + "ec2:DescribeAvailabilityZones",
                          + "ec2:DescribeAddresses",
                          + "ec2:DescribeAccountAttributes",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "wafv2:GetWebACLForResource",
                          + "wafv2:GetWebACL",
                          + "wafv2:DisassociateWebACL",
                          + "wafv2:AssociateWebACL",
                          + "waf-regional:GetWebACLForResource",
                          + "waf-regional:GetWebACL",
                          + "waf-regional:DisassociateWebACL",
                          + "waf-regional:AssociateWebACL",
                          + "shield:GetSubscriptionState",
                          + "shield:DescribeProtection",
                          + "shield:DeleteProtection",
                          + "shield:CreateProtection",
                          + "iam:ListServerCertificates",
                          + "iam:GetServerCertificate",
                          + "cognito-idp:DescribeUserPoolClient",
                          + "acm:ListCertificates",
                          + "acm:DescribeCertificate",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "ec2:RevokeSecurityGroupIngress",
                          + "ec2:CreateSecurityGroup",
                          + "ec2:AuthorizeSecurityGroupIngress",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                  + {
                      + Action    = "ec2:CreateTags"
                      + Condition = {
                          + Null         = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster" = "false"
                            }
                          + StringEquals = {
                              + "ec2:CreateAction" = "CreateSecurityGroup"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:ec2:*:*:security-group/*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = [
                          + "ec2:DeleteTags",
                          + "ec2:CreateTags",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster"  = "true"
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:ec2:*:*:security-group/*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = [
                          + "ec2:RevokeSecurityGroupIngress",
                          + "ec2:DeleteSecurityGroup",
                          + "ec2:AuthorizeSecurityGroupIngress",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:CreateTargetGroup",
                          + "elasticloadbalancing:CreateLoadBalancer",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                      + Sid       = ""
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:DeleteRule",
                          + "elasticloadbalancing:DeleteListener",
                          + "elasticloadbalancing:CreateRule",
                          + "elasticloadbalancing:CreateListener",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:RemoveTags",
                          + "elasticloadbalancing:AddTags",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster"  = "true"
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = [
                          + "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/net/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/app/*/*",
                        ]
                      + Sid       = ""
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:RemoveTags",
                          + "elasticloadbalancing:AddTags",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:elasticloadbalancing:*:*:listener/net/*/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:listener/app/*/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:listener-rule/net/*/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:listener-rule/app/*/*/*",
                        ]
                      + Sid      = ""
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:SetSubnets",
                          + "elasticloadbalancing:SetSecurityGroups",
                          + "elasticloadbalancing:SetIpAddressType",
                          + "elasticloadbalancing:ModifyTargetGroupAttributes",
                          + "elasticloadbalancing:ModifyTargetGroup",
                          + "elasticloadbalancing:ModifyLoadBalancerAttributes",
                          + "elasticloadbalancing:DeleteTargetGroup",
                          + "elasticloadbalancing:DeleteLoadBalancer",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = "elasticloadbalancing:AddTags"
                      + Condition = {
                          + Null         = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster" = "false"
                            }
                          + StringEquals = {
                              + "elasticloadbalancing:CreateAction" = [
                                  + "CreateTargetGroup",
                                  + "CreateLoadBalancer",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = [
                          + "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/net/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/app/*/*",
                        ]
                      + Sid       = ""
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:RegisterTargets",
                          + "elasticloadbalancing:DeregisterTargets",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:SetWebAcl",
                          + "elasticloadbalancing:RemoveListenerCertificates",
                          + "elasticloadbalancing:ModifyRule",
                          + "elasticloadbalancing:ModifyListener",
                          + "elasticloadbalancing:AddListenerCertificates",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "App" = "platform-eks-dev"
        }
      + tags_all    = {
          + "App"            = "platform-eks-dev"
          + "Env"            = "dev"
          + "ManagedBy"      = "Terraform"
          + "OrchestratedBy" = "Terramate"
          + "Stack"          = "platform-k8s-apps"
          + "StackPath"      = "/stacks/platform/platform-k8s/apps"
        }
    }

  # module.load_balancer_controller_irsa.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "[null]:aud" = "sts.amazonaws.com"
                              + "[null]:sub" = "system:serviceaccount:kube-system:aws-load-balancer-controller"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = jsonencode(
                                [
                                  + null,
                                ]
                            )
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "aws-load-balancer-controller-dev"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "App" = "platform-eks-dev"
        }
      + tags_all              = {
          + "App"            = "platform-eks-dev"
          + "Env"            = "dev"
          + "ManagedBy"      = "Terraform"
          + "OrchestratedBy" = "Terramate"
          + "Stack"          = "platform-k8s-apps"
          + "StackPath"      = "/stacks/platform/platform-k8s/apps"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.load_balancer_controller_irsa.aws_iam_role_policy_attachment.load_balancer_controller[0] will be created
  + resource "aws_iam_role_policy_attachment" "load_balancer_controller" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "aws-load-balancer-controller-dev"
    }

  # module.node_termination_handler_irsa.aws_iam_policy.node_termination_handler[0] will be created
  + resource "aws_iam_policy" "node_termination_handler" {
      + arn         = (known after apply)
      + description = "Provides permissions to handle node termination events via the Node Termination Handler"
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "AmazonEKS_Node_Termination_Handler_Policy-"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:DescribeInstances",
                          + "autoscaling:DescribeTags",
                          + "autoscaling:DescribeAutoScalingInstances",
                          + "autoscaling:CompleteLifecycleAction",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "sqs:ReceiveMessage",
                          + "sqs:DeleteMessage",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "App" = "platform-eks-dev"
        }
      + tags_all    = {
          + "App"            = "platform-eks-dev"
          + "Env"            = "dev"
          + "ManagedBy"      = "Terraform"
          + "OrchestratedBy" = "Terramate"
          + "Stack"          = "platform-k8s-apps"
          + "StackPath"      = "/stacks/platform/platform-k8s/apps"
        }
    }

  # module.node_termination_handler_irsa.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "[null]:aud" = "sts.amazonaws.com"
                              + "[null]:sub" = "system:serviceaccount:kube-system:aws-node-termination-handler"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = jsonencode(
                                [
                                  + null,
                                ]
                            )
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "node-termination-handler-dev"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "App" = "platform-eks-dev"
        }
      + tags_all              = {
          + "App"            = "platform-eks-dev"
          + "Env"            = "dev"
          + "ManagedBy"      = "Terraform"
          + "OrchestratedBy" = "Terramate"
          + "Stack"          = "platform-k8s-apps"
          + "StackPath"      = "/stacks/platform/platform-k8s/apps"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.node_termination_handler_irsa.aws_iam_role_policy_attachment.node_termination_handler[0] will be created
  + resource "aws_iam_role_policy_attachment" "node_termination_handler" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "node-termination-handler-dev"
    }

Plan: 30 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
"

```

</details>

*Pusher: @kaio6fellipe, Action: `pull_request`, Workflow: `Terraform plan`*